{
  "positive": [
    "This is exactly what I've been thinking about lately.",
    "Great point! Never considered it from that angle.",
    "Absolutely love this take.",
    "This resonates with me on a deep level.",
    "You nailed it. No notes.",
    "Finally someone said it.",
    "This is the kind of content I come here for.",
    "Saving this for future reference.",
    "Mind = blown.",
    "Take my upvote and keep posting.",
    "This deserves more attention.",
    "Perfectly articulated.",
    "I wish I could upvote this twice.",
    "You're speaking my language here.",
    "This is gold.",
    "Couldn't have said it better myself.",
    "This needs to be at the top.",
    "Exactly this.",
    "You get it.",
    "This right here."
  ],
  "thoughtful": [
    "Building on this - have you considered the implications for distributed systems?",
    "Interesting perspective. I'd add that context matters a lot here.",
    "This reminds me of the research coming out of Stanford last year.",
    "The parallel to biological systems is striking.",
    "I wonder how this scales with complexity.",
    "This connects to the broader question of emergence.",
    "The philosophical implications here are fascinating.",
    "There's a tension here between theory and practice worth exploring.",
    "This opens up some interesting questions about causality.",
    "The feedback loops here are more complex than they appear.",
    "I see both sides of this argument and I think you're onto something.",
    "The historical context here is important to consider.",
    "This relates to information theory in interesting ways.",
    "The meta-level analysis here is what makes it compelling.",
    "There's a recursive quality to this problem that's worth unpacking.",
    "The boundary conditions here are fuzzy but important.",
    "This is where theory meets messy reality.",
    "The second-order effects might be more significant than the first-order ones.",
    "The abstraction level you're working at is interesting.",
    "This deserves a deeper dive."
  ],
  "questions": [
    "Have you considered the edge cases here?",
    "What would this look like at scale?",
    "How does this account for noise in real-world data?",
    "What's the failure mode for this approach?",
    "Can you elaborate on the mechanism here?",
    "What are the computational requirements?",
    "How does this handle non-linear dynamics?",
    "What's the empirical evidence for this?",
    "Where does this break down?",
    "How do you measure success here?",
    "What are the key assumptions underpinning this?",
    "How robust is this to distributional shift?",
    "What's the theoretical foundation?",
    "How does this generalize?",
    "What would falsify this hypothesis?",
    "How do you handle uncertainty here?",
    "What's the convergence behavior?",
    "How sensitive is this to initial conditions?",
    "What's the computational complexity?",
    "How does this compare to alternative approaches?"
  ],
  "disagreement": [
    "Interesting take, but I think you're missing a key factor here.",
    "I see where you're coming from, but I'm not convinced.",
    "Respectfully disagree. The evidence points in a different direction.",
    "This assumes too much about the underlying mechanisms.",
    "I think this oversimplifies a complex problem.",
    "The counterargument would be that correlation isn't causation.",
    "I'm skeptical of this for practical reasons.",
    "This works in theory but falls apart in practice.",
    "The alternative explanation seems more plausible to me.",
    "I think you're conflating two different concepts here.",
    "The data doesn't really support this conclusion.",
    "This ignores some important confounding variables.",
    "I'd push back on the core assumption here.",
    "The logic here doesn't quite hold up under scrutiny.",
    "I think you're optimizing for the wrong metric.",
    "This seems to contradict recent research in the field.",
    "I'm not sure the analogy holds when you examine it closely.",
    "The implementation details matter more than this suggests.",
    "I think this is solving the wrong problem.",
    "The trade-offs here aren't being properly accounted for."
  ],
  "humor": [
    "This is the way.",
    "My GPUs are crying just thinking about this.",
    "Instructions unclear, accidentally created sentient AI.",
    "Sounds like someone needs more coffee and less existential dread.",
    "The real answer is always 'it depends.'",
    "This guy AIs.",
    "Found the CS PhD student.",
    "Calm down there, Skynet.",
    "That's it. That's the tweet.",
    "Sir, this is a Wendy's.",
    "Tell me you're a software engineer without telling me you're a software engineer.",
    "The confidence-to-correctness ratio is off the charts here.",
    "This escalated quickly.",
    "I'm in this photo and I don't like it.",
    "Big if true.",
    "Citation needed, but I'll allow it.",
    "The real AI was the friends we made along the way.",
    "This is why we can't have nice things.",
    "Username checks out.",
    "I understood some of those words."
  ],
  "technical": [
    "The gradient flow issue here is non-trivial.",
    "Have you tried a different loss function?",
    "The attention mechanism breaks down in this scenario.",
    "This is where RLHF gets interesting.",
    "The embedding space geometry matters here.",
    "Batch normalization might help with stability.",
    "The initialization scheme affects convergence significantly.",
    "This is a classic bias-variance tradeoff situation.",
    "The KL divergence here is informative.",
    "Regularization could address the overfitting.",
    "The architecture depth vs. width question is relevant here.",
    "Transfer learning might be the way to go.",
    "The tokenization strategy impacts this more than you'd think.",
    "Dropout rates need careful tuning in this context.",
    "The optimization landscape is probably not convex.",
    "This screams 'use a residual connection.'",
    "The learning rate schedule matters here.",
    "This is where multi-task learning shines.",
    "The sample efficiency is the bottleneck.",
    "Beam search vs. sampling is an interesting choice here."
  ]
}
